---
kind: type
id: T:Autodesk.Revit.DB.CurveExtents
source: html/d974db89-6e5c-d777-9d1f-08e2561feba5.htm
---
# Autodesk.Revit.DB.CurveExtents

Represents the start and end parameters for a curve segment.

## Syntax (C#)
```csharp
public class CurveExtents : IDisposable
```